""" PSIT PROJECT
Subject : 'จำแนกผู้ย้ายถิ่นที่อยู่ก่อนย้ายและที่อยู่ปัจจุบัน'
made by :
          1. นายกิตติบุญ สัตบุษ    59070016
          2. นายจิรายุส  ไพรวรรณ 59070026
          3. นายธนวรรษ ประดับราช 59070069
          4. นายนาวิน   พูลสวัสดิ์  59070088"""
import pygal
def function14():
    """Show graph that calculated of subject"""
    line_chart = pygal.Bar()
    line_chart.title = 'จำแนกผู้ย้ายถิ่นที่อยู่ก่อนย้ายและที่อยู่ปัจจุบัน'
    line_chart.x_labels = map(str, ("ใต้", "ตะวันออกเฉียงเหนือ", "เหนือ", "กลาง", "กรุงเทพมหานคร"))
    line_chart.add('มาจากภาคใต้', [0.5, 8.7, 2.5, 4.1, 5.4])
    line_chart.add('มาจากภาคตะวันออกเฉียงเหนือ',  [4.4, 0.5, 13.7, 36.4, 45.5])
    line_chart.add('มาจากภาคเหนือ',      [4.6, 5.7, 0.5, 23.4, 17.5])
    line_chart.add('มาจากภาคกลาง',  [7.1, 40.8, 22.0, 0.5, 38.3])
    line_chart.add('มาจากกรุงเทพมหานคร',  [4.2, 29.5, 8.6, 13.4, 0.5])
    line_chart.render_to_file('14.svg')
function14()
